DiplomArs4/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ГрафикОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DiplomArs4/src/AccumulationRegisters/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ДнейОтпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

DiplomArs4/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаРасчета = Параметры.Дата;
	ГодРасчета = Параметры.Год;
	
	Дата = Дата(ГодРасчета,Месяц(ДатаРасчета), День(ДатаРасчета));
	Год = ГодРасчета;
	
КонецПроцедуры 
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Диаграмма.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусковОбороты.Сотрудник КАК Сотрудник,
		|	ВКМ_ГрафикОтпусковОбороты.ДатаНачала КАК ДатаНачала,
		|	ВКМ_ГрафикОтпусковОбороты.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	РегистрНакопления.ВКМ_ГрафикОтпусков.Обороты(&НачалоПериод, &КонецПериод, , Год = &Год) КАК ВКМ_ГрафикОтпусковОбороты";
	
	
	Запрос.УстановитьПараметр("КонецПериод", КонецГода(Дата));
	Запрос.УстановитьПараметр("НачалоПериод", НачалоГода(Дата));
	Запрос.УстановитьПараметр("Год", Год);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Серия = Диаграмма.УстановитьСерию("Отпуск");
	Серия.Текст = "Отпуск";
	Серия.Цвет = WebЦвета.Аквамарин;
	
	Пока Выборка.Следующий() Цикл
		
		 Точка = Диаграмма.УстановитьТочку(Выборка.Сотрудник);
		 Точка.Текст = Выборка.Сотрудник;
		 Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
		 
		 Интервал = Значение.Добавить();
		 Интервал.Начало = Выборка.ДатаНачала;
		 Интервал.Конец = Выборка.ДатаОкончания;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
